In [1]:
import pandas as pd
import numpy as np

In [3]:
df_inventory = pd.read_csv('MS-b1-inventory.csv')
df_inventory.head()

         date  apple   pen
0  2006-01-31  12157   811
1  2006-02-28  29859  2280
2  2006-03-31  42135  3317
3  2006-04-30  55235  4094
4  2006-05-31  66963  5158

In [24]:
from datetime import date, timedelta, datetime

In [29]:
def daterange(start_date, end_date):
    for n in range(int((end_date - start_date).days)):
        yield start_date + timedelta(n)

In [31]:
start_date = datetime.strptime(df_inventory.date[0], '%Y-%m-%d').date()
print(start_date)

end_date = datetime.strptime(df_inventory.date[len(df_inventory) - 1], '%Y-%m-%d').date()
print(end_date)

#for single_date in daterange(start_date, end_date):
#    print(single_date.strftime("%Y-%m-%d"))

2006-01-31
2015-12-31

In [55]:
res_df = pd.DataFrame(columns=['date', 'apple', 'pen'])

start_date = datetime.strptime(df_inventory.date[0], '%Y-%m-%d').date()
start_apple = df_inventory.apple[0]
start_pen = df_inventory.pen[0]

for cur_inventory in df_inventory.values[1:]:
    end_date = datetime.strptime(cur_inventory[0], '%Y-%m-%d').date()
    end_apple = cur_inventory[1]
    end_pen = cur_inventory[2]

    diff_month_apple = end_apple - start_apple
    diff_month_pen = end_pen - start_pen

    daily_apple = diff_month_apple / (end_date - start_date).days
    daily_pen = diff_month_pen / (end_date - start_date).days
    
    for single_date in daterange(start_date, end_date):
        cur_days = (single_date - start_date).days

        cur_apple = int(start_apple + cur_days * daily_apple)
        cur_pen = int(start_pen + cur_days * daily_pen)

        single_d = single_date.strftime("%Y-%m-%d")

        cur_df = pd.DataFrame(columns=['date', 'apple', 'pen'], data=[[single_d, cur_apple, cur_pen]])
        res_df = pd.concat([res_df, cur_df], ignore_index=True)

    start_date = end_date
    start_apple = end_apple
    start_pen = end_pen

str_d = start_date.strftime("%Y-%m-%d")
cur_df = pd.DataFrame(columns=['date', 'apple', 'pen'], data=[[str_d, start_apple, start_pen]])
res_df = pd.concat([res_df, cur_df], ignore_index=True)
res_df.head()

         date  apple   pen
0  2006-01-31  12157   811
1  2006-02-01  12789   863
2  2006-02-02  13421   915
3  2006-02-03  14053   968
4  2006-02-04  14685  1020

In [56]:
res_df.tail()

            date    apple     pen
3617  2015-12-27  1567875  122489
3618  2015-12-28  1568262  122517
3619  2015-12-29  1568650  122545
3620  2015-12-30  1569037  122573
3621  2015-12-31  1569425  122601

In [57]:
df_inventory.tail()

           date    apple     pen
115  2015-08-31  1518055  118479
116  2015-09-30  1532120  119640
117  2015-10-31  1543664  120608
118  2015-11-30  1557415  121734
119  2015-12-31  1569425  122601

In [59]:
df_inventory[df_inventory.date == '2006-02-28']

         date  apple   pen
1  2006-02-28  29859  2280

In [60]:
res_df[res_df.date == '2006-02-28']

          date  apple   pen
28  2006-02-28  29859  2280